lo-co/i2s-tdm-loopback-test/pin_mux.c
    const uint32_t Timing_Int_2 = (/* Pin is configured as PIO1_13 */
                                   IOPCTL_PIO_FUNC0 |
                                   /* Disable pull-up / pull-down function */
                                   IOPCTL_PIO_PUPD_DI |
                                   /* Enable pull-down function */
                                   IOPCTL_PIO_PULLDOWN_EN |
                                   /* Disable input buffer function */
                                   IOPCTL_PIO_INBUF_DI |
                                   /* Normal mode */
                                   IOPCTL_PIO_SLEW_RATE_NORMAL |
                                   /* Normal drive */
                                   IOPCTL_PIO_FULLDRIVE_DI |
                                   /* Analog mux is disabled */
                                   IOPCTL_PIO_ANAMUX_DI |
                                   /* Pseudo Output Drain is disabled */
                                   IOPCTL_PIO_PSEDRAIN_DI |
                                   /* Input function is not inverted */
                                   IOPCTL_PIO_INV_DI);
    /* PORT1 PIN13 (coords: N1) is configured as PIO1_13 */
    IOPCTL_PinMuxSet(IOPCTL, BOARD_INITPINS_Timing_Int_2_PORT, BOARD_INITPINS_Timing_Int_2_PIN, Timing_Int_2);

    const uint32_t Timing_Int_1 = (/* Pin is configured as PIO1_14 */
                                   IOPCTL_PIO_FUNC0 |
                                   /* Disable pull-up / pull-down function */
                                   IOPCTL_PIO_PUPD_DI |
                                   /* Enable pull-down function */
                                   IOPCTL_PIO_PULLDOWN_EN |
                                   /* Disable input buffer function */
                                   IOPCTL_PIO_INBUF_DI |
                                   /* Normal mode */
                                   IOPCTL_PIO_SLEW_RATE_NORMAL |
                                   /* Normal drive */
                                   IOPCTL_PIO_FULLDRIVE_DI |
                                   /* Analog mux is disabled */
                                   IOPCTL_PIO_ANAMUX_DI |
                                   /* Pseudo Output Drain is disabled */
                                   IOPCTL_PIO_PSEDRAIN_DI |
                                   /* Input function is not inverted */
                                   IOPCTL_PIO_INV_DI);
    /* PORT1 PIN14 (coords: N2) is configured as PIO1_14 */
    IOPCTL_PinMuxSet(IOPCTL, BOARD_INITPINS_Timing_Int_1_PORT, BOARD_INITPINS_Timing_Int_1_PIN, Timing_Int_1);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
